Autodesk.Revit.DB.FabricationPart.OptimizeLengths(Autodesk.Revit.DB.Document,System.Collections.Generic.ISet`1{Autodesk.Revit.DB.ElementId})
Optimizes the length fabrication straight parts.
doc:
The document.
partIds:
The ids of the fabrication parts in a selected fabrication part run.
Returns:
New and modified fabrication part ids in the optimize
Throws Autodesk.Revit.Exceptions.ArgumentException:
There are no straight parts to optimize, or all parts are locked or locked by group membership.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
this operation failed.
Since:
2016

Autodesk.Revit.DB.FabricationPart.GetProductListEntryName(System.Int32)
Gets the specified product entry name.
index:
The product entry index.
Returns:
Returns the specified product entry name.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The product entry index is not larger than 0 and less than GetProductCount.
Since:
2016 Subscription Release

Autodesk.Revit.DB.FabricationPart.SetCalculatedDimensionValue(Autodesk.Revit.DB.FabricationDimensionDefinition,System.String)
Sets the calculated dimension value.
Remarks:
Multiple dimensions may need to be set in order to reach the desired outcome.
The document must be regenerated before the fabrication part can be used.
Check ValidationStatus after regeneration to see if the part is valid for fabrication.
dim:
The fabrication dimension.
value:
The calculated dimension value.
Throws Autodesk.Revit.Exceptions.ArgumentException:
value is not a valid calulated fabrication dimenstion value.
-or-
fabrication dimension is unable to be modified because it is locked or from a product list.
-or-
the fabrication dimension is unable to be modified because it will affect the geometry of a connected end.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
the fabrication dimension is unable to be modified because the fabrication part is connected to more than one object.
-or-
the fabrication dimension cannot be set to the option: value.
Since:
2016

Autodesk.Revit.DB.FabricationPart.IsDimensionCalculated(Autodesk.Revit.DB.FabricationDimensionDefinition)
Checks if the fabricataion dimension is calculated.
dim:
The fabrication dimension.
Returns:
True if the fabricataion dimension is calculated.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.FabricationPart.SetDimensionValue(Autodesk.Revit.DB.FabricationDimensionDefinition,System.Double)
Sets the fabrication dimension value. The value is in revit internal units.
Remarks:
Multiple dimensions may need to be set in order to reach the desired outcome.
The document must be regenerated before the fabrication part can be used.
Check ValidationStatus after regeneration to see if the part is valid for fabrication.
dim:
The fabrication dimension.
newValue:
The dimension value.
Throws Autodesk.Revit.Exceptions.ArgumentException:
fabrication dimension is unable to be modified because it is locked or from a product list.
-or-
the fabrication dimension is unable to be modified because it will affect the geometry of a connected end.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
the fabrication dimension is unable to be modified because the fabrication part is connected to more than one object.
-or-
the fabrication dimension cannot be set to the value: newValue.
Since:
2016

Autodesk.Revit.DB.FabricationPart.GetDimensionValue(Autodesk.Revit.DB.FabricationDimensionDefinition)
Gets the value of the fabrication dimension, returns value in Revit internal units.
dim:
The fabrfication dimension.
Returns:
The dimension value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.FabricationPart.IsProductListEntryCompatibleSize(System.Int32)
Checks to see if this part can be changed to the specified product entry without altering any connected dimensions.
productListEntry:
The product list entry index.
Returns:
Returns true if the part can be changed to the specified product entry without altering any connected dimensions.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The product entry index is not larger than 0 and less than GetProductCount.
Since:
2016 Subscription Release

Autodesk.Revit.DB.FabricationPart.CreateHanger(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.FabricationServiceButton,System.Int32,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Connector,System.Double,System.Boolean)
Creates a hanger on the fabrication part.
document:
The document.
button:
The fabrication service button to use.
condition:
The condition index. If the button has multiple conditions.
hostId:
The host part id. The host should be one horizontal straight part.
hostConnector:
The connector of the host.
distance:
The distance from the input connector of the host part. Units are in feet (ft).
attachToStructure:
Attach to the nearest structural element. The structural element might be one of Floor/Roof/Stair/Stucture Framing.
Returns:
The newly-created fabrication hanger.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Hangers may only be placed on straight horizontal fabrication segments.
-or-
Invalid fabrication service button.
-or-
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
the index condition is not larger or equal to 0 and less than ConditionCount
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
the distance is out of range.
-or-
cannot find suitable fabrication part for the host.
-or-
cannot place hanger on the host.
Since:
2016

Autodesk.Revit.DB.FabricationPart.CreateHanger(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.FabricationServiceButton,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Connector,System.Double,System.Boolean)
Creates a hanger on the fabrication part.
document:
The document.
button:
The fabrication service button to use. It finds the matching condition automatically if the button has multiple condition.
hostId:
The host part id. The host should be one horizontal straight part.
hostConnector:
The connector of the host.
distance:
The distance from the input connector of the host part. Units are in feet (ft).
attachToStructure:
Attach to the nearest structural element. The structural element might be one of Floor/Roof/Stair/Stucture Framing.
Returns:
The newly-created fabrication hanger.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Hangers may only be placed on straight horizontal fabrication segments.
-or-
Invalid fabrication service button.
-or-
-or-
The distance is out of range.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.FabricationPart.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.FabricationServiceButton,System.Int32,Autodesk.Revit.DB.ElementId)
Creates a fabrication part element based on button.
document:
The document.
button:
The fabrication service button to use.
condition:
The condition index.
levelId:
The level identifier.
Returns:
The new fabrication part.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Please use FabricationPart.CreateHanger to create fabrication hanger.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
the index condition is not larger or equal to 0 and less than ConditionCount
Since:
2016

Autodesk.Revit.DB.FabricationPart.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.FabricationServiceButton,System.Double,System.Double,Autodesk.Revit.DB.ElementId)
Creates a fabrication part element based on button and size.
document:
The document.
button:
The fabrication service button to use. Matches button condition based on the specified size.
width:
The width of the part. Units are in feet (ft).
depth:
The depth of the part. Units are in feet (ft). It should be equal to width for round part.
levelId:
The level identifier.
Returns:
The new fabrication part.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Please use FabricationPart.CreateHanger to create fabrication hanger.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
failing to match a button condition based on specific size.
Since:
2016

Autodesk.Revit.DB.FabricationPart.InsulationSpecification
The fabrication part insulation specification identifier.
Remarks:
A value of 0 indicates the insulation specification is set to off.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: the insulation specification is invalid for the fabrication part.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: the fabrication part has taps connected.
-or-
When setting this property: the specification fails to be set by identifier: specId.
Since:
2016

Autodesk.Revit.DB.FabricationPart.ServiceId
The fabrication part service identifier.
Since:
2016 Subscription Release

Autodesk.Revit.DB.FabricationPart.ProductListEntry
The product list entry index of the fabrication part. A value of -1 indicates the fabrication part is not a product list entry.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: modifying the product entry will cause the dimensions of connected ends to change.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The product entry index is not larger than 0 and less than GetProductCount.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property:
-or-
When setting this property: the product entry fails to be set by index: productEntryIndex.
Since:
2016 Subscription Release